app/Helpers/custom_helper.php

    function hasCalendarData(){
        $db      = \Config\Database::connect();
        $builder = $db->table('events');
        $calendarQuery = $builder->select('*')
            ->where('ev_status',1)
            ->where('ev_delete',null)
            ->join('newsevents','newsevents.ne_id=events.events_id')
            ->get();
        $calendarData = $calendarQuery->getResult();

        // Fetch Online Meeting Events for calendar
        $online_meetings_builder = $db->table('online_meeting');
        $onlineMeetingsQuery = $online_meetings_builder->select("*")
        ->where('deleted_at',null)
        ->get();
---
SELECT *
FROM `events`
JOIN `newsevents` ON `newsevents`.`ne_id`=`events`.`events_id`
WHERE `ev_status` = 1
AND `ev_delete` IS NULL
SELECT *
FROM `online_meeting`
WHERE `deleted_at` IS NULL

    function getUserData($userId)
    {
        $db = db_connect();
        $mViewsTable = $db->table('users');
        $userInfo = $mViewsTable->select('*')
            ->where('u_id', $userId)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `users`
WHERE `u_id` = '13'