app/Controllers/Admin.php

    public function allDonations()
    {
        if (isAdmin()){
            $tableProjects =  new ModProjects();
            $tableProjects->select('projects.*')
                ->orderBy('project_id','desc');
            $allProjects = $tableProjects->paginate(20);
            $donationsModel = new ModDonations();

            foreach ($allProjects as &$project) {
                // Retrieve the count of members for the current group
                $contributions = $donationsModel->where(['project_id' => $project['project_id']])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `projects`
SELECT `projects`.*
FROM `projects`
ORDER BY `project_id` DESC
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `donations`
WHERE `project_id` = '2'