app/Controllers/Admin.php

SELECT *
FROM `interest_groups`
WHERE `group_id` = '1'
AND `interest_groups`.`deleted_at` IS NULL
SELECT `interest_group_members`.*
FROM `interest_group_members`
JOIN `users` ON `interest_group_members`.`user_id` = `users`.`u_id`
WHERE `group_id` = '1'
AND `interest_group_members`.`deleted_at` IS NULL
ORDER BY `member_id` DESC
SELECT COUNT(*) AS `numrows`
FROM `interest_group_members`
LEFT JOIN `users` ON `interest_group_members`.`user_id` = `users`.`u_id`
WHERE `group_id` = '1'
AND `interest_group_members`.`deleted_at` IS NULL
SELECT `interest_group_members`.*, `users`.*
FROM `interest_group_members`
LEFT JOIN `users` ON `interest_group_members`.`user_id` = `users`.`u_id`
WHERE `group_id` = '1'
AND `interest_group_members`.`deleted_at` IS NULL
ORDER BY `member_id` DESC
 LIMIT 20
---
    public function viewInterestGroupMembers($group_id)
    {
        if (isAdmin()){
            $groupModel = new ModInterestGroups();
            $memberModel = new ModInterestGroupMembers();

            // Retrieve the count of members for the current group
            $group = $groupModel->where(['group_id' => $group_id])->findAll();
            $memberModel->select('interest_group_members.*, users.*')
            ->join('users','interest_group_members.user_id = users.u_id')
            ->where(['group_id' => $group_id])
            ->orderBy('member_id','desc')
            ->findAll();

            $data = [
                'group' => $group,
                'allMembers' => $memberModel->paginate(20),
                'pager' => $memberModel->pager
            ];