app/Controllers/Donations.php

SELECT *
FROM `projects`
WHERE `project_id` = '1'
SELECT *
FROM `projects`
WHERE `project_id` != '1'
ORDER BY RAND()
SELECT `donations`.*, `users`.`u_dp`, `users`.`u_first_name`, `users`.`u_last_name`, `users`.`u_email`, `users`.`u_mobile`
FROM `donations`
JOIN `users` ON `donations`.`user_id` = `users`.`u_id`
WHERE `project_id` = '1'
---
    public function read($id)
    {
        if (!empty($id) && isset($id)) {
            $tableProjects  = new ModProjects();
            $donationsModel  = new ModDonations();
            $data['userLoggedIn'] = userLoggedIn();

            $checkProject = $tableProjects->select()
                ->where([
                    'project_id'=>$id,
                ])
                ->findAll();

            $checkOtherProject = $tableProjects->select()
            ->where('project_id !=', $id)
            ->orderBy('RAND()')
            ->limit(5)
            ->findAll();

            $donations = $donationsModel->select("donations.*, users.u_dp, users.u_first_name, users.u_last_name, users.u_email, users.u_mobile")
                ->join('users', 'donations.user_id = users.u_id', 'left')
                ->where([
                    'project_id'=>$id,
                ])
                ->findAll();