app/Controllers/Home.php

    public function index()
    {
        $tablePClip = new ModNewEvents();
        $tableHowITWorks = new ModHowITWorks();
        $tableWhatWeDo = new ModHomeSection();//What We Do Section
        $talbeCalendar = new ModEvents();
        $talbleWebsiteSetting = new Settings();
        $tableSliders = new Sliders();
        $tableOnlineMeeting = new ModOnlineMeeting();
        $db      = \Config\Database::connect();
        $builder = $db->table('events');
        $calendarQuery = $builder->select('*')
            ->where('ev_status',1)
            ->where('DATE(start_date) >',date('Y-m-d'))
            ->join('newsevents','newsevents.ne_id=events.events_id')
            ->limit(5)->get();
        $data['upcomingevents'] = $calendarQuery->getResult();

        $data['websiteSetting'] = $talbleWebsiteSetting->findAll();

        $data['newshome']= $tablePClip->where('ne_category','news')->findAll(3);
        $data['eventshome']= $tablePClip->where('ne_category','events')->findAll(3);
        $data['onlinemeetings']= $tableOnlineMeeting->findAll(3);
---
SELECT *
FROM `events`
JOIN `newsevents` ON `newsevents`.`ne_id`=`events`.`events_id`
WHERE `ev_status` = 1
AND DATE(start_date) >= '2024-05-27'
 LIMIT 5
SELECT *
FROM `events`
JOIN `newsevents` ON `newsevents`.`ne_id`=`events`.`events_id`
WHERE `ev_status` = 1
 LIMIT 10
SELECT *
FROM `online_meeting`
 LIMIT 3