app/Controllers/InterestGroups.php

    public function index(){
        $data = [];

        $filter = $this->request->getGet('filter');

        $data['title'] = 'Interest Groups' . PROJECT;
        $data['description'] = 'Interest Groups Description here';

        $tableInterestGroups = new ModInterestGroups();

        if($filter == "newest"){
            $tableInterestGroups->select('interest_groups.*, admin.aName')
            ->join('admin', 'interest_groups.admin_id = admin.aId')
            ->orderBy('group_id', 'desc');
        }elseif($filter == "oldest"){
            $tableInterestGroups->select('interest_groups.*, admin.aName')
            ->join('admin', 'interest_groups.admin_id = admin.aId')
            ->orderBy('group_id', 'asc');
        }elseif($filter == "popular"){
            $tableInterestGroups->select('interest_groups.*, admin.aName, COUNT(igm.member_id) AS num_members')
            ->join('interest_group_members igm', 'interest_groups.group_id = igm.group_id', 'left')
            ->join('admin', 'interest_groups.admin_id = admin.aId', 'left')
            ->orderBy('num_members', 'desc');
        }else{
            $tableInterestGroups->select('interest_groups.*, admin.aName')
            ->join('admin', 'interest_groups.admin_id = admin.aId');
        }

        $groups = $tableInterestGroups->paginate(5);
        $totalGroups = $tableInterestGroups->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `interest_groups`
JOIN `admin` ON `interest_groups`.`admin_id` = `admin`.`aId`
WHERE `interest_groups`.`deleted_at` IS NULL
SELECT `interest_groups`.*, `admin`.`aName`
FROM `interest_groups`
JOIN `admin` ON `interest_groups`.`admin_id` = `admin`.`aId`
WHERE `interest_groups`.`deleted_at` IS NULL
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `interest_group_members`
WHERE `group_id` = '1'
AND `interest_group_members`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `interest_groups`
WHERE `interest_groups`.`deleted_at` IS NULL

    public function read($id)
    {
        if (!empty($id) && isset($id)) {
            $tableInterestGroup  = new ModInterestGroups();
            $memberModel  = new ModInterestGroupMembers();
            $isMember = false;

            $checkInterestGroup = $tableInterestGroup->select()
                ->where([
                    'group_id'=>$id,
                ])
                ->findAll();

            $members = $memberModel->select('interest_group_members.*, users.u_first_name, users.u_last_name')
            ->join('users','interest_group_members.user_id = users.u_id')
            ->where(['group_id' => $id])
            ->orderBy('member_id','desc')
            ->findAll();

            $checkOtherGroups = $tableInterestGroup->select()
            ->where('group_id !=', $id)
            ->orderBy('RAND()')
            ->limit(5)
            ->findAll();

            if(userLoggedIn()){
                // Check if user is part of group
                $checkMembership = $memberModel->select()
                ->where('group_id', $id)
                ->where('user_id', getUserId())
                ->countAllResults();
---
SELECT *
FROM `interest_groups`
WHERE `group_id` = '1'
AND `interest_groups`.`deleted_at` IS NULL
SELECT `interest_group_members`.*, `users`.`u_first_name`, `users`.`u_last_name`
FROM `interest_group_members`
JOIN `users` ON `interest_group_members`.`user_id` = `users`.`u_id`
WHERE `group_id` = '1'
AND `interest_group_members`.`deleted_at` IS NULL
ORDER BY `member_id` DESC
SELECT *
FROM `interest_groups`
WHERE `group_id` != '1'
AND `interest_groups`.`deleted_at` IS NULL
ORDER BY RAND()
SELECT COUNT(*) AS `numrows`
FROM `interest_group_members`
WHERE `group_id` = '1'
AND `user_id` = '13'
AND `interest_group_members`.`deleted_at` IS NULL