app/Controllers/InterestGroups.php

SELECT COUNT(*) AS `numrows`
FROM `interest_groups`
JOIN `admin` ON `interest_groups`.`admin_id` = `admin`.`aId`
WHERE `interest_groups`.`deleted_at` IS NULL
SELECT `interest_groups`.*, `admin`.`aName`
FROM `interest_groups`
JOIN `admin` ON `interest_groups`.`admin_id` = `admin`.`aId`
WHERE `interest_groups`.`deleted_at` IS NULL
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `interest_group_members`
WHERE `group_id` = '1'
AND `interest_group_members`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `interest_groups`
WHERE `interest_groups`.`deleted_at` IS NULL
---
    public function index(){
        $data = [];

        $filter = $this->request->getGet('filter');

        $data['title'] = 'Interest Groups' . PROJECT;
        $data['description'] = 'Interest Groups Description here';

        $tableInterestGroups = new ModInterestGroups();

        if($filter == "newest"){
            $tableInterestGroups->select('interest_groups.*, admin.aName')
            ->join('admin', 'interest_groups.admin_id = admin.aId')
            ->orderBy('group_id', 'desc');
        }elseif($filter == "oldest"){
            $tableInterestGroups->select('interest_groups.*, admin.aName')
            ->join('admin', 'interest_groups.admin_id = admin.aId')
            ->orderBy('group_id', 'asc');
        }elseif($filter == "popular"){
            $tableInterestGroups->select('interest_groups.*, admin.aName, COUNT(igm.member_id) AS num_members')
            ->join('interest_group_members igm', 'interest_groups.group_id = igm.group_id', 'left')
            ->join('admin', 'interest_groups.admin_id = admin.aId', 'left')
            ->orderBy('num_members', 'desc');
        }else{
            $tableInterestGroups->select('interest_groups.*, admin.aName')
            ->join('admin', 'interest_groups.admin_id = admin.aId');
        }

        $groups = $tableInterestGroups->paginate(5);
        $totalGroups = $tableInterestGroups->countAllResults();