app/Controllers/NewsEvents.php

    public function index()
    {
        $tablePClip = new ModNewEvents();
        $filters = filterWhereForModels();
        //dd($filters);
        $tablePClip
            ->where('newsevents.ne_status',1)
            ->where('newsevents.ne_category','news')
            ->orderBy('newsevents.ne_id','desc');
        if ($filters && count($filters) == 1) {
            $tablePClip->like('newsevents.ne_title',$filters['newsevents.ne_title']);
        }
        $data = [
            'news' => $tablePClip->paginate(5),
            'pager' => $tablePClip->pager,
            'filtrs' => filterForView(),
        ];
---
SELECT *
FROM `newsevents`
WHERE `newsevents`.`ne_status` = 1
AND `newsevents`.`ne_category` = 'news'
AND `newsevents`.`ne_deleted` IS NULL
ORDER BY `newsevents`.`ne_id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `newsevents`
WHERE `newsevents`.`ne_status` = 1
AND `newsevents`.`ne_category` = 'news'
AND `newsevents`.`ne_deleted` IS NULL

    public function events()
    {
        $tablePClip = new ModNewEvents();
        $tableCalendar = new ModEvents();
        $filters = filterWhereForModels();

        $db      = \Config\Database::connect();
        $builder = $db->table('events');
        $calendarQuery = $builder->select('*')
            ->where('ev_status',1)
            ->where('ev_delete',null)
            ->join('newsevents','newsevents.ne_id=events.events_id')
            ->limit(10)->get();
---
SELECT *
FROM `events`
JOIN `newsevents` ON `newsevents`.`ne_id`=`events`.`events_id`
WHERE `ev_status` = 1
AND `ev_delete` IS NULL
 LIMIT 10

    public function fetchevents()
    {
        // This function returns all events and online meetings... for quickevents calendar
        /* Result should be something like - "{
        "title": "International Music Awards Ceremony",
        "image": "event_1.jpg",
        "day": "3",
        "month": "5",
        "year": "2024",
        "duration": 2,
        "time": "9:00 - 16:30",
        "color": "1",
        "location": "Viderer , 43st Wardour Street, London UK",
        "description": "<a href=\"http://google.com\">Lorem ipsum</a> dolor sit amet, consectetur adipiscing elit. Nullam non ornare eros. Ut pharetra ornare lorem, sit amet bibendum quam imperdiet ut. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nullam non ornare eros. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nullam non ornare eros. Ut pharetra ornare lorem, sit amet bibendum quam imperdiet ut. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nullam non ornare eros."
        }"*/

        $db      = \Config\Database::connect();
        $builder = $db->table('events');
        $calendarQuery = $builder->select('*')
            ->where('ev_status',1)
            ->where('ev_delete',null)
            ->join('newsevents','newsevents.ne_id=events.events_id')
            ->get();
        $calendarData = $calendarQuery->getResult();
---
SELECT *
FROM `events`
JOIN `newsevents` ON `newsevents`.`ne_id`=`events`.`events_id`
WHERE `ev_status` = 1
AND `ev_delete` IS NULL


        // Fetch Online Meeting Events for calendar
        $online_meetings_builder = $db->table('online_meeting');
        $onlineMeetingsQuery = $online_meetings_builder->select("*")
        ->where('deleted_at',null)
        ->get();
---
SELECT *
FROM `online_meeting`
WHERE `deleted_at` IS NULL