app/Controllers/OnlineMeetings.php

SELECT COUNT(*) AS `numrows`
FROM `online_meeting`
JOIN `admin` ON `online_meeting`.`admin_id` = `admin`.`aId`
SELECT `online_meeting`.*, `admin`.`aName`
FROM `online_meeting`
JOIN `admin` ON `online_meeting`.`admin_id` = `admin`.`aId`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `online_meeting`
---
    public function index(){
        $data = [];

        $filter = $this->request->getGet('filter');

        $data['title'] = 'Online Meetings' . PROJECT;
        $data['description'] = 'Online Meetings Description here';

        $tableOnlineMeetings = new ModOnlineMeeting();

        if($filter == "newest"){
            $tableOnlineMeetings->select('online_meeting.*, admin.aName')
            ->join('admin', 'online_meeting.admin_id = admin.aId')
            ->orderBy('id', 'desc');
        }elseif($filter == "oldest"){
            $tableOnlineMeetings->select('online_meeting.*, admin.aName')
            ->join('admin', 'online_meeting.admin_id = admin.aId')
            ->orderBy('group_id', 'asc');
        }else{
            $tableOnlineMeetings->select('online_meeting.*, admin.aName')
            ->join('admin', 'online_meeting.admin_id = admin.aId');
        }

        $meetings = $tableOnlineMeetings->paginate(5);
        $totalMeetings = $tableOnlineMeetings->countAllResults();

SELECT *
FROM `online_meeting`
WHERE `id` != '5'
ORDER BY RAND()
---
    public function read($id)
    {
        if (!empty($id) && isset($id)) {
            $tableOnlineMeetings  = new ModOnlineMeeting();
            $userLoggedIn = userLoggedIn();

            $checkOnlineMeeting = $tableOnlineMeetings->select()
            ->where([
                'id'=>$id,
            ])
            ->findAll();

            $checkOtherMeetings = $tableOnlineMeetings->select()
            ->where('id !=', $id)
            ->orderBy('RAND()')
            ->limit(5)
            ->findAll();