app/Controllers/User.php

SELECT *
FROM `events`
JOIN `newsevents` ON `newsevents`.`ne_id`=`events`.`events_id`
WHERE `ev_status` = 1
AND `ev_delete` IS NULL
 LIMIT 10
SELECT *
FROM `events`
WHERE `ev_status` = 1
AND `events`.`ev_delete` IS NULL
---
    public function index()
    {
        if (userLoggedIn()) {
            $tableUsers = new ModUsers();
            $tableGallery = new ModGallery();
            $tableEvents = new ModEvents();
            $db      = \Config\Database::connect();
            $builder = $db->table('events');
            $calendarQuery = $builder->select('*')
                ->where('ev_status',1)
                ->where('ev_delete', null)
                ->join('newsevents','newsevents.ne_id=events.events_id')
                ->limit(10)->get();
            $calendarData = $calendarQuery->getResult();
            $data = array();

            if (count($calendarData) > 0) {
                foreach ($calendarData as $key => $value) {
                    $data['calendarData'][$key]['title'] = $value->title;
                    $data['calendarData'][$key]['start'] = $value->start_date;
                    $data['calendarData'][$key]['end'] = $value->end_date;
                    $data['calendarData'][$key]['backgroundColor'] = "#DA9F37";
                }
            }else{
                $data['calendarData'] = array();
            }

            $data['countUsers']  = $tableUsers->where('u_status',1)->findAll();
            $data['countGallery']  = $tableGallery->where('gl_status',1)->findAll();
            $data['countEvents']  = $tableEvents->where('ev_status',1)->findAll();