app/Models/ModAdmin.php

    public function checkAdmin($data)
    {
        return $this->where(['email'=>$data['email'],'password'=>$data['password']])->findAll();
---
SELECT *
FROM `admin`
WHERE `email` = 'shakzee171@gmail.com'
AND `password` = 'dc468c70fb574ebd07287b38d0d0676d'
AND `admin`.`a_delete` IS NULL